MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX128ZVLQ10/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MK20DX128ZVLQ10_H__
#define __MK20DX128ZVLQ10_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   111               // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -92              // Not available device specific interrupt
#define InitStackPointer_IRQn                   -16              // Initial Stack Pointer
#define InitProgramCounter_IRQn                 -15              // Initial Program Counter
#define NonMaskableInterrupt_IRQn               -14              // Non-maskable Interrupt (NMI)
#define HardFault_IRQn                          -13              // Hard Fault
#define MemManageFault_IRQn                     -12              // MemManage Fault
#define BusFault_IRQn                           -11              // Bus Fault
#define UsageFault_IRQn                         -10              // Usage Fault
#define SVCall_IRQn                             -5               // Supervisor call (SVCall)
#define DebugMonitor_IRQn                       -4               // Debug Monitor
#define PendSV_IRQn                             -2               // Pendable request for system service (PendableSrvReq)
#define SysTick_IRQn                            -1               // System tick timer (SysTick)
#define DMA0_IRQn                               0                // DMA channel 0 transfer complete
#define DMA1_IRQn                               1                // DMA channel 1 transfer complete
#define DMA2_IRQn                               2                // DMA channel 2 transfer complete
#define DMA3_IRQn                               3                // DMA channel 3 transfer complete
#define DMA4_IRQn                               4                // DMA channel 4 transfer complete
#define DMA5_IRQn                               5                // DMA channel 5 transfer complete
#define DMA6_IRQn                               6                // DMA channel 6 transfer complete
#define DMA7_IRQn                               7                // DMA channel 7 transfer complete
#define DMA8_IRQn                               8                // DMA channel 8 transfer complete
#define DMA9_IRQn                               9                // DMA channel 9 transfer complete
#define DMA10_IRQn                              10               // DMA channel 10 transfer complete
#define DMA11_IRQn                              11               // DMA channel 11 transfer complete
#define DMA12_IRQn                              12               // DMA channel 12 transfer complete
#define DMA13_IRQn                              13               // DMA channel 13 transfer complete
#define DMA14_IRQn                              14               // DMA channel 14 transfer complete
#define DMA15_IRQn                              15               // DMA channel 15 transfer complete
#define DMA_Error_IRQn                          16               // DMA error interrupt channels 0-15
#define Normal_Interrupt_IRQn                   17               // Normal interrupt
#define Command_Complete_IRQn                   18               // Command complete
#define Read_Collision_IRQn                     19               // Read collision
#define PMC_IRQn                                20               // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               21               // Low Leakage Wakeup
#define Watchdog_Interrupt_IRQn                 22               // Watchdog interrupt
#define I2C0_IRQn                               24               // -
#define I2C1_IRQn                               25               // -
#define SPI0_IRQn                               26               // Single interrupt vector for all sources
#define SPI1_IRQn                               27               // Single interrupt vector for all sources
#define SPI2_IRQn                               28               // Single interrupt vector for all sources
#define CAN0_0Red_Message_buffer_IRQn           29               // OR'ed Message buffer (0-15)
#define CAN0_Bus_Off_IRQn                       30               // Bus Off
#define CAN0_Error_IRQn                         31               // Error
#define CAN0_Tx_Warning_IRQn                    32               // Transmit Warning
#define CAN0_Rx_Warning_IRQn                    33               // Receive Warning
#define CAN0_Wake_Up_IRQn                       34               // Wake Up
#define CAN1_0Red_Message_buffer_IRQn           37               // OR'ed Message buffer (0-15)
#define CAN1_Bus_Off_IRQn                       38               // Bus off
#define CAN1_Error_IRQn                         39               // Error
#define CAN1_Tx_Warning_IRQn                    40               // Transmit Warning
#define CAN1_Rx_Warning_IRQn                    41               // Receive Warning
#define CAN1_Wake_Up_IRQn                       42               // Wake Up
#define UART0_RX_TX_IRQn                        45               // Single interrupt vector for UART status sources
#define UART0_ERR_IRQn                          46               // Single interrupt vector for UART error sources
#define UART1_RX_TX_IRQn                        47               // Single interrupt vector for UART status sources
#define UART1_ERR_IRQn                          48               // Single interrupt vector for UART error sources
#define UART2_RX_TX_IRQn                        49               // Single interrupt vector for UART status sources
#define UART2_ERR_IRQn                          50               // Single interrupt vector for UART error sources
#define UART3_RX_TX_IRQn                        51               // Single interrupt vector for UART status sources
#define UART3_ERR_IRQn                          52               // Single interrupt vector for UART error sources
#define UART4_RX_TX_IRQn                        53               // Single interrupt vector for UART status sources
#define UART4_ERR_IRQn                          54               // Single interrupt vector for UART error sources
#define UART5_RX_TX_IRQn                        55               // Single interrupt vector for UART status sources
#define UART5_ERR_IRQn                          56               // Single interrupt vector for UART error sources
#define ADC0_IRQn                               57               // -
#define ADC1_IRQn                               58               // -
#define CMP0_IRQn                               59               // -
#define CMP1_IRQn                               60               // -
#define CMP2_IRQn                               61               // -
#define FTM0_IRQn                               62               // Single interrupt vector for all sources
#define FTM1_IRQn                               63               // Single interrupt vector for all sources
#define FTM2_IRQn                               64               // Single interrupt vector for all sources
#define CMT_IRQn                                65               // -
#define Alarm_Interrupt_IRQn                    66               // Alarm interrupt
#define PIT0_IRQn                               68               // Channel 0
#define PIT1_IRQn                               69               // Channel 1
#define PIT2_IRQn                               70               // Channel 2
#define PIT3_IRQn                               71               // Channel 3
#define PDB_IRQn                                72               // -
#define USB_OTG_IRQn                            73               // -
#define USB_Charger_Detect_IRQn                 74               // -
#define I2S0_IRQn                               79               // -
#define SDHC_IRQn                               80               // -
#define DAC0_IRQn                               81               // -
#define DAC1_IRQn                               82               // -
#define Single_Interrupt_Vector_For_All_SourceS_IRQn 83               // Single interrupt vector for all sources
#define MCG_IRQn                                84               // -
#define LPTMR0_IRQn                             85               // -
#define PORTA_IRQn                              87               // Pin detect (Port A)
#define PORTB_IRQn                              88               // Pin detect (Port B)
#define PORTC_IRQn                              89               // Pin detect (Port C)
#define PORTD_IRQn                              90               // Pin detect (Port D)
#define PORTE_IRQn                              91               // Pin detect (Port E)
#define Software_Interrupt_IRQn                 94               // Software interrupt



//*****************************************************************************
//
// Port control and interrupts (PORT) registers
//
//*****************************************************************************

